ГТС/УТГТС/InformationRegisters/КоличествоЗаписейРегистраторовРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЗаписейРегистраторовРасчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗаписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ГТС/УТГТС/AccumulationRegisters/РасчетыСКлиентамиПоСрокам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКлиентамиПоСрокам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Предоплата</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредоплатаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолгУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьКорОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСКлиентами</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.РасчетКурсовыхРазниц</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктПремииКлиенту</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЯндексКассе</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаГрафикаВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРегистров</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковНДСПредъявленного</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочиеРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковОПродажахЗаПрошлыеПериоды</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковРасчетовПоЭквайрингу</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковСПодотчетниками</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковПрочихАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗаписиВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаписейВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСКлиентом</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлановогоПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВозникновения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетовСКлиентами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыРасчетовСПартнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРасчетовСПартнерами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКредитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСДебитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСАрендодателем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Documents/РегистраторРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РегистраторРасчетов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПланОплат</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПланПоставок</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПланОтгрузок</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКлиентамиПоСрокам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПоСрокам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПоставщикамиПланОплат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетовСПартнерами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/InformationRegisters/КоличествоЗаписейРегистраторовРасчетов/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь();
	КоманднаяПанель.ПодчиненныеЭлементы.ФормаОбновитьДанныеРегистра.Видимость = ЭтоПолноправныйПользователь;
	
	Если Параметры.Свойство("АвтоТест") ИЛИ ЭтоПолноправныйПользователь Тогда
		Возврат;
	КонецЕсли;
	
	ТолькоПросмотр = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьДанныеРегистра(Команда)
	ОбновитьДанныеРегистраНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ОбновитьДанныеРегистраНаСервере()

	ДокументыКОбработке = Новый ТаблицаЗначений;
	ДокументыКОбработке.Колонки.Добавить("Документ", Новый ОписаниеТипов("ДокументСсылка.РегистраторРасчетов"));

	ЗапросДокументы = Новый Запрос;
	ЗапросДокументы.Текст = "
	|ВЫБРАТЬ
	|	РегистраторыРасчетов.Ссылка КАК Документ
	|ИЗ
	|	Документ.РегистраторРасчетов КАК РегистраторыРасчетов";

	ВыборкаДокументов = ЗапросДокументы.Выполнить().Выбрать();
	КоличествоЗаписейКОбработке = 0;

	Пока ВыборкаДокументов.Следующий() Цикл

		КоличествоЗаписейКОбработке = КоличествоЗаписейКОбработке + 1;
		ЗаполнитьЗначенияСвойств(ДокументыКОбработке.Добавить(), ВыборкаДокументов);

		Если КоличествоЗаписейКОбработке = 1000 Тогда
			ОбработатьДанныеРегистра(ДокументыКОбработке);
			ДокументыКОбработке.Очистить();
			КоличествоЗаписейКОбработке = 0;
		КонецЕсли;

	КонецЦикла;

	Если ДокументыКОбработке.Количество() > 0 Тогда
		ОбработатьДанныеРегистра(ДокументыКОбработке);
	КонецЕсли;

КонецПроцедуры

// Обработать порцию документов и записать данные в регистр.
// 
// Параметры:
//  ДокументыКОбработке - ТаблицаЗначений - Документы к обработке:
// * Документ - ДокументСсылка.РегистраторРасчетов - 
//
&НаСервереБезКонтекста
Процедура ОбработатьДанныеРегистра(ДокументыКОбработке)
	
	Запрос = Новый Запрос;

	ЗапросРасчетыСПартнерами = Новый Запрос;
	ТекстЗапросаРасчетыСКлиентами = "
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСКлиентамиПоСрокам"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСКлиентамиПоСрокам"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСКлиентамиПланОплат"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОплат КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСКлиентамиПланОплат"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСКлиентамиПланОтгрузок"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПланОтгрузок КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСКлиентамиПланОтгрузок"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор";
	
	ТекстЗапросаРасчетыСПоставщиками = "
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСПоставщикамиПоСрокам"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСПоставщикамиПоСрокам"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСПоставщикамиПланОплат"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланОплат КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСПоставщикамиПланОплат"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Регистр.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов КАК ОбъектРасчетов,
	|	Регистр.Валюта КАК Валюта,
	|	""РасчетыСПоставщикамиПланПоставок"" КАК ИмяТаблицы,
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	Регистр.Регистратор КАК Документ,
	|	КОЛИЧЕСТВО(Регистр.НомерСтроки) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПланПоставок КАК Регистр
	|ГДЕ
	|	Регистр.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	Регистр.АналитикаУчетаПоПартнерам,
	|	Регистр.ОбъектРасчетов,
	|	Регистр.Валюта,
	|	""РасчетыСПоставщикамиПланПоставок"",
	|	НАЧАЛОПЕРИОДА(Регистр.Период, ДЕНЬ),
	|	Регистр.Регистратор";

	Запрос = Новый Запрос();
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Данные.Документ КАК Документ
	|ПОМЕСТИТЬ ВтДанныеДляОбработки
	|ИЗ
	|	&ДокументыКОбработке КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанныеДляОбработки.Документ КАК Документ,
	|	ЕСТЬNULL(РегистраторРасчетов.ТипРасчетов, ЗНАЧЕНИЕ(Перечисление.ТипыРасчетовСПартнерами.ПустаяСсылка)) КАК ТипРасчетов
	|ИЗ
	|	ВтДанныеДляОбработки КАК ВтДанныеДляОбработки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистраторРасчетов КАК РегистраторРасчетов
	|		ПО РегистраторРасчетов.Ссылка = ВтДанныеДляОбработки.Документ";
	Запрос.УстановитьПараметр("ДокументыКОбработке", ДокументыКОбработке);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Не ЗначениеЗаполнено(Выборка.ТипРасчетов) Тогда
			Продолжить;
		КонецЕсли;

		НачатьТранзакцию();

		Попытка
			НаборЗаписей = РегистрыСведений.КоличествоЗаписейРегистраторовРасчетов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);

			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.КоличествоЗаписейРегистраторовРасчетов");
			ЭлементБлокировки.УстановитьЗначение("Документ", Выборка.Документ);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Если Выборка.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом Тогда

				ЗапросРасчетыСПартнерами.Текст = ТекстЗапросаРасчетыСКлиентами;

				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПланОплат.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			Иначе

				ЗапросРасчетыСПартнерами.Текст = ТекстЗапросаРасчетыСПоставщиками;

				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПоСрокам.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщикамиПланОплат.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

				ЭлементБлокировки = Блокировка.Добавить(
					"РегистрНакопления.РасчетыСПоставщикамиПланПоставок.НаборЗаписей");
				ЭлементБлокировки.УстановитьЗначение("Регистратор", Выборка.Документ);
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;

			КонецЕсли;

			Блокировка.Заблокировать();

			ЗапросРасчетыСПартнерами.УстановитьПараметр("Регистратор", Выборка.Документ);
			ВыборкаРасчетыСПартнерами = ЗапросРасчетыСПартнерами.Выполнить().Выбрать();

			Пока ВыборкаРасчетыСПартнерами.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасчетыСПартнерами);
			КонецЦикла;

			НаборЗаписей.Записать();

			ЗафиксироватьТранзакцию();

		Исключение

			ОтменитьТранзакцию();
			ТекстСообщения = НСтр("ru = 'Не удалось обновить данные регистра ""Количество записей регистраторов расчетов"": %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Обновление данных регистра ""Количество записей регистраторов расчетов""'"),
				УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.КоличествоЗаписейРегистраторовРасчетов,
				ТекстСообщения);

			ВызватьИсключение ТекстСообщения;

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
